validation_cases/workshop1/damBreakWithObstacle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) 
    (3.22 0 0)
    (3.22 1 0)
    (0 1 0)

    (0 0 1) 
    (3.22 0 1)
    (3.22 1 1)
    (0 1 1)

    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (59 19 17) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
	      (2 3 7 6)
        );
    }
    
    walls
    {
        type wall;
        faces
        (
         (0 1 5 4)
         (0 4 7 3)
         (0 3 2 1)
         (6 5 1 2)
         (6 7 4 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
